package com.hegemonica.game.logic.scenarios.gemelch;

import com.badlogic.gdx.utils.FloatArray;

public class ProvCoords { // тестовый класс для хранения массивов тестовых провинций. провинции создаются уже по карте
    public static final FloatArray levianProv = new FloatArray(new float[]{711, 268, 711, 258, 717, 252, 718, 240, 726, 238, 729, 234, 740, 232, 749, 231, 751, 238, 754, 243, 753, 265,
            750, 274, 737, 273, 727, 272, 719, 268});
    public static final FloatArray valiniaProv = new FloatArray(new float[]{749, 231, 749, 224, 776, 224, 776, 225, 787, 225, 787, 233, 788, 233, 788, 240, 791, 241, 791, 246, 792, 246, 792, 254, 793, 254, 793, 266, 792, 266,
            792, 271, 793, 271, 793, 276, 794, 276, 794, 279, 795, 279, 795, 282, 794, 283, 794, 286, 793, 286, 793, 290, 792, 290, 792, 291, 790, 291, 790, 292, 784, 292, 784, 293, 782, 293, 782, 292, 772, 292, 772, 291, 770, 291,
            763, 284, 760, 283, 757, 283, 755, 281, 755, 279, 751, 276, 753, 265, 754, 243, 751, 238, 749, 231});

    public ProvCoords() {
    }
}
